ci4/app/Models/DaftarModel.php

SELECT *
FROM `warga`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `warga`
---
  public function getDaftar($nik = false)
  {
    if ($nik === false) {
      return $this->paginate(10, 'warga');